Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C32E_1.xml
        <register caption="SLCDC Mode Register" name="SLCDC_MR" offset="0x4" rw="RW" size="4">
          <bitfield caption="Selection of the Number of Commons" mask="0x00000007" name="COMSEL" values="SLCDC_MR__COMSEL"/>
          <bitfield caption="Selection of the Number of Segments" mask="0x00003F00" name="SEGSEL"/>
          <bitfield caption="Buffer On-Time" mask="0x000F0000" name="BUFTIME" values="SLCDC_MR__BUFTIME"/>
          <bitfield caption="LCD Display Configuration" mask="0x00300000" name="BIAS" values="SLCDC_MR__BIAS"/>
          <bitfield caption="Low Power Mode (Taken into account from the next begin of frame.)" mask="0x01000000" name="LPMODE"/>
        </register>
        <register caption="SLCDC Frame Rate Register" name="SLCDC_FRR" offset="0x8" rw="RW" size="4">
          <bitfield caption="Clock Prescaler" mask="0x00000007" name="PRESC" values="SLCDC_FRR__PRESC"/>
          <bitfield caption="Clock Division" mask="0x00000700" name="DIV" values="SLCDC_FRR__DIV"/>
        </register>
        <register caption="SLCDC Display Register" name="SLCDC_DR" offset="0xC" rw="RW" size="4">
          <bitfield caption="Display Mode Register" mask="0x00000007" name="DISPMODE" values="SLCDC_DR__DISPMODE"/>
          <bitfield caption="LCD Blinking Frequency Selection" mask="0x0000FF00" name="LCDBLKFREQ"/>
        </register>
        <register caption="SLCDC Status Register" name="SLCDC_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Enable Status (Automatically Set/Reset)" mask="0x00000001" name="ENA"/>
        </register>
        <register caption="SLCDC Interrupt Enable Register" name="SLCDC_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="End of Frame Interrupt Enable" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Interrupt Enable" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="SLCDC Interrupt Disable Register" name="SLCDC_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Frame Interrupt Disable" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Interrupt Disable" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="SLCDC Interrupt Mask Register" name="SLCDC_IMR" offset="0x28" rw="W" size="4">
          <bitfield caption="End of Frame Interrupt Mask" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Interrupt Mask" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="SLCDC Interrupt Status Register" name="SLCDC_ISR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Frame Interrupt Mask" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Interrupt Mask" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="SLCDC Segment Map Register 0" name="SLCDC_SMR0" offset="0x30" rw="RW" size="4">
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000001" name="LCD0"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000002" name="LCD1"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000004" name="LCD2"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000008" name="LCD3"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000010" name="LCD4"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000020" name="LCD5"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000040" name="LCD6"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000080" name="LCD7"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000100" name="LCD8"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000200" name="LCD9"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000400" name="LCD10"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000800" name="LCD11"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00001000" name="LCD12"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00002000" name="LCD13"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00004000" name="LCD14"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00008000" name="LCD15"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00010000" name="LCD16"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00020000" name="LCD17"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00040000" name="LCD18"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00080000" name="LCD19"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00100000" name="LCD20"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00200000" name="LCD21"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00400000" name="LCD22"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00800000" name="LCD23"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x01000000" name="LCD24"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x02000000" name="LCD25"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x04000000" name="LCD26"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x08000000" name="LCD27"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x10000000" name="LCD28"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x20000000" name="LCD29"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x40000000" name="LCD30"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x80000000" name="LCD31"/>
        </register>
        <register caption="SLCDC Segment Map Register 1" name="SLCDC_SMR1" offset="0x34" rw="RW" size="4">
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000001" name="LCD32"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000002" name="LCD33"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000004" name="LCD34"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000008" name="LCD35"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000010" name="LCD36"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000020" name="LCD37"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000040" name="LCD38"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000080" name="LCD39"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000100" name="LCD40"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000200" name="LCD41"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000400" name="LCD42"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00000800" name="LCD43"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00001000" name="LCD44"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00002000" name="LCD45"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00004000" name="LCD46"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00008000" name="LCD47"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00010000" name="LCD48"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O pin" mask="0x00020000" name="LCD49"/>
        </register>
        <register caption="SLCDC Write Protect Mode Register" name="SLCDC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="SLCDC Write Protect Status Register" name="SLCDC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 0)" name="SLCDC_LMEMR0" offset="0x200" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 0)" name="SLCDC_MMEMR0" offset="0x204" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 1)" name="SLCDC_LMEMR1" offset="0x208" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 1)" name="SLCDC_MMEMR1" offset="0x20C" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 2)" name="SLCDC_LMEMR2" offset="0x210" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 2)" name="SLCDC_MMEMR2" offset="0x214" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
        <register caption="SLCDC LSB Memory Register (com = 3)" name="SLCDC_LMEMR3" offset="0x218" rw="RW" size="4">
          <bitfield caption="LSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="SLCDC MSB Memory Register (com = 3)" name="SLCDC_MMEMR3" offset="0x21C" rw="RW" size="4">
          <bitfield caption="MSB Pixels pattern associated to COMx terminal" mask="0xFFFFFFFF" name="MPIXEL"/>
        </register>
