Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C32E_1.xml
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_CTRL__UIDE">
        <value caption="The USB mode (device/host) is selected from the UIMOD bit." name="UIMOD" value="0"/>
        <value caption="The USB mode (device/host) is selected from the UOTGID input pin." name="UOTGID" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_CTRL__UIMOD">
        <value caption="The module is in USB host mode." name="HOST" value="0"/>
        <value caption="The module is in USB device mode." name="DEVICE" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_SR__SPEED">
        <value caption="Full-Speed mode" name="FULL_SPEED" value="0x0"/>
        <value caption="Low-Speed mode" name="LOW_SPEED" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_FSM__DRDSTATE">
        <value caption="This is the start state for A-devices (when the ID pin is 0)" name="A_IDLESTATE" value="0x0"/>
        <value caption="In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V)." name="A_WAIT_VRISE" value="0x1"/>
        <value caption="In this state, the A-device waits for the B-device to signal a connection." name="A_WAIT_BCON" value="0x2"/>
        <value caption="In this state, the A-device that operates in Host mode is operational." name="A_HOST" value="0x3"/>
        <value caption="The A-device operating as a host is in the suspend mode." name="A_SUSPEND" value="0x4"/>
        <value caption="The A-device operates as a peripheral." name="A_PERIPHERAL" value="0x5"/>
        <value caption="In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V)." name="A_WAIT_VFALL" value="0x6"/>
        <value caption="In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state." name="A_VBUS_ERR" value="0x7"/>
        <value caption="In this state, the A-device waits for the data USB line to discharge (100 us)." name="A_WAIT_DISCHARGE" value="0x8"/>
        <value caption="This is the start state for B-device (when the ID pin is 1)." name="B_IDLE" value="0x9"/>
        <value caption="In this state, the B-device acts as the peripheral." name="B_PERIPHERAL" value="0xA"/>
        <value caption="In this state, the B-device is in suspend mode and waits until 3 ms before initiating the HNP protocol if requested." name="B_WAIT_BEGIN_HNP" value="0xB"/>
        <value caption="In this state, the B-device waits for the data USB line to discharge (100 us) before becoming Host." name="B_WAIT_DISCHARGE" value="0xC"/>
        <value caption="In this state, the B-device waits for the A-device to signal a connect before becoming B-Host." name="B_WAIT_ACON" value="0xD"/>
        <value caption="In this state, the B-device acts as the Host." name="B_HOST" value="0xE"/>
        <value caption="In this state, the B-device attempts to start a session using the SRP protocol." name="B_SRP_INIT" value="0xF"/>
      </value-group>
    </module>
